app/views/home/index.html.erb

SELECT COUNT(*) AS count_all, EXTRACT(DOW FROM "products"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::integer AS extract_dow_from_products_created_at_timestamptz_at_time_zone_e FROM "products" WHERE ("products"."created_at" IS NOT NULL) GROUP BY EXTRACT(DOW FROM "products"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::integer
---
                    <%# line_chart User.group(:created_at).count, width: "280px", height: "150px" %>
                    <%= line_chart Product.group_by_day_of_week(:created_at, format: "%a", reverse: true).count, width: "100%", height: "230px" %>

SELECT MAX("stores"."updated_at") AS maximum_updated_at, "stores"."created_at" AS stores_created_at FROM "stores" GROUP BY "stores"."created_at"
SELECT COUNT(*) AS count_all, EXTRACT(DOW FROM "stores"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::integer AS extract_dow_from_stores_created_at_timestamptz_at_time_zone_etc FROM "stores" WHERE ("stores"."created_at" IS NOT NULL) GROUP BY EXTRACT(DOW FROM "stores"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::integer
---
                    <%# line_chart User.group(:created_at).count, width: "280px", height: "150px" %>
                    <%= line_chart Store.group_by_day_of_week(:created_at, format: "%a", reverse: true).count, width: "100%", height: "230px" %>

SELECT COUNT(*) AS count_all, DATE_TRUNC('minute', "users"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC' AS date_trunc_minute_users_created_at_timestamptz_at_time_zone_etc FROM "users" WHERE ("users"."created_at" IS NOT NULL) GROUP BY DATE_TRUNC('minute', "users"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC') AT TIME ZONE 'Etc/UTC'
SELECT COUNT(*) AS count_all, EXTRACT(DOW FROM "users"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::integer AS extract_dow_from_users_created_at_timestamptz_at_time_zone_etc_ FROM "users" WHERE ("users"."created_at" IS NOT NULL) GROUP BY EXTRACT(DOW FROM "users"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::integer
---
                    <%# line_chart User.group(:created_at).count, width: "280px", height: "150px" %>
                    <%= area_chart User.group_by_day_of_week(:created_at, format: "%a", reverse: true).count, width: "100%", height: "230px" %>