app/views/user_profiles/_form.html.erb

SELECT "access_kinds".* FROM "access_kinds"
---
            <%= accesses_fields.label :access_kind_id %>
            <%= accesses_fields.collection_select( :access_kind_id, AccessKind.all, :id, :description ) %>

SELECT "access_kinds".* FROM "access_kinds"
---
              <%= accesses_fields.label :access_kind_id %>
              <%= accesses_fields.collection_select( :access_kind_id, AccessKind.all, :id, :description ) %>