app/controllers/access_kinds_controller.rb

SELECT "access_kinds".* FROM "access_kinds"
---
  def index
    @access_kinds = AccessKind.all

INSERT INTO "access_kinds" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "manager"], ["created_at", "2020-03-06 01:52:40.813743"], ["updated_at", "2020-03-06 01:52:40.813743"]]
---
  def create
    @access_kind = AccessKind.new(access_kind_params)

    respond_to do |format|
      if @access_kind.save

SELECT  "access_kinds".* FROM "access_kinds" WHERE "access_kinds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_access_kind
      @access_kind = AccessKind.find(params[:id])