app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("name", "email", "kind", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Leandro Michel"], ["email", "michel@gmail.com"], ["kind", "merchant"], ["created_at", "2020-03-04 03:30:24.156921"], ["updated_at", "2020-03-04 03:30:24.156921"]]

    def set_client
      @client = Client.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]