app/controllers/deliveries_controller.rb

  def index
    @deliveries = Delivery.all
---
SELECT "deliveries".* FROM "deliveries"

  def create
    @delivery = Delivery.new(delivery_params)

    respond_to do |format|
      if @delivery.save
---
INSERT INTO "deliveries" ("description", "priority", "status", "user_id", "client_id", "product_id", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_delivery
      @delivery = Delivery.find(params[:id])
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]