app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("code", "description", "store_id", "price", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["code", "1278"], ["description", "Black Cookie"], ["store_id", 1], ["price", 1.99], ["status", 1], ["created_at", "2020-02-28 17:17:21.015761"], ["updated_at", "2020-02-28 17:17:21.015761"]]

    def set_product
      @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]