app/controllers/profile_accesses_controller.rb

  def index
    @profile_accesses = ProfileAccess.all
---
SELECT "profile_accesses".* FROM "profile_accesses"