app/controllers/stores_controller.rb

  def index
    @stores = Store.all
---
SELECT "stores".* FROM "stores"

  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("description", "codename", "kind", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Store Rails-street"], ["codename", 502], ["kind", "retail"], ["created_at", "2020-02-28 17:13:44.352466"], ["updated_at", "2020-02-28 17:13:44.352466"]]

    def set_store
      @store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]