app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "super_user" = $2, "office" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["name", "Marcelo Henrique da Silva Sousa"], ["super_user", true], ["office", "Product Engineer"], ["updated_at", "2020-02-28 17:12:42.270861"], ["id", 1]]