app/controllers/user_profiles_controller.rb

  def index
    @user_profiles = UserProfile.all
---
SELECT "user_profiles".* FROM "user_profiles"

  def create
    @user_profile = UserProfile.new(user_profile_params)

    respond_to do |format|
      if @user_profile.save
---
INSERT INTO "user_profiles" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "General Manager"], ["created_at", "2020-03-06 01:59:03.358688"], ["updated_at", "2020-03-06 01:59:03.358688"]]

  def update
    @user_profile.destroy
    @user_profile = UserProfile.new(user_profile_params)

    respond_to do |format|
      if @user_profile.save
---
DELETE FROM "user_profiles" WHERE "user_profiles"."id" = $1  [["id", 7]]
INSERT INTO "user_profiles" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Operations manager"], ["created_at", "2020-03-06 02:55:38.318843"], ["updated_at", "2020-03-06 02:55:38.318843"]]

  def destroy
    @user_profile.destroy
---
DELETE FROM "user_profiles" WHERE "user_profiles"."id" = $1  [["id", 9]]

    def set_user_profile
      @user_profile = UserProfile.find(params[:id])
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]